{
  "architectures": [
    "GptOssForCausalLM"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "dtype": "float32",
  "experts_per_token": 2,
  "head_dim": 32,
  "hidden_act": "silu",
  "hidden_size": 128,
  "initial_context_length": 256,
  "initializer_range": 0.02,
  "intermediate_size": 256,
  "layer_types": [
    "sliding_attention",
    "full_attention"
  ],
  "max_position_embeddings": 4096,
  "model_type": "gpt_oss",
  "num_attention_heads": 4,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 2,
  "num_key_value_heads": 1,
  "num_local_experts": 4,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "beta_fast": 32.0,
    "beta_slow": 1.0,
    "factor": 32.0,
    "original_max_position_embeddings": 4096,
    "rope_type": "yarn",
    "truncate": false
  },
  "rope_theta": 150000,
  "router_aux_loss_coef": 0.9,
  "sliding_window": 64,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.6",
  "use_cache": false,
  "vocab_size": 201088
}
